[
    {
        "title": "Как мы обнаглели и просто скопировали Jira Service Management",
        "description": "После ухода компании Atlassian мы взялись за задачу по импортозамещению её продуктов. И если ранее мы уже заменили Jira и Confluence, то теперь пришла очередь другого крупного продукта - Jira Service Management. \nНаконец-то можно рассказать о том, что мы успели сделать в его замене - EvaServiceDesk. Мы уже показывали альфа-версию продукта для сообщества Atlassian Community Moscow, теперь официальный релиз в проде.\nЕсли при разработке аналога обычной Jira (о котором мы писали здесь) мы напоролись на проблему того, что пользователям нужно переучиваться на новый интерфейс. То в этот раз мы решили пойти простым (и выигрышным на наш взгляд) путем. Просто сделали привычный интерфейс и функционал, но на новых технологиях и сразу закладывая возможности для дальнейшего расширения.",
        "data": "2023-04-06, 15:22",
        "rating": "+6"
    },
    {
        "title": "Миша на севере 2 [О работе айтишником на крайнем севере]",
        "description": "Привет всем, меня зовут Миша и я сеньор разработчик EvaTeam. Это продолжения поста о том, как я отправился работать на архипелаг Новосибирские острова, что находится в Северном Ледовитом океане, в качестве специалиста по информационным технологиям и связи. В прошлый раз я рассказывал о первой поездке в 2015 году. А сейчас сразу перенесусь в будущее (или прошлое) и расскажу о второй вахте в 2017 году. Вы узнаете о высокотехнологичном авиационном ведре, ремонте средств связи с использованием скотча и крепком питании.",
        "data": "2023-03-30, 14:31",
        "rating": "+127"
    },
    {
        "title": "Как мы реализовали автоматизацию «как в Jira» в российском продукте",
        "description": "Всем привет, меня зовут Алексей - я руководитель отдела интеграции EvaTeam. Это статья о том, как реализована настройка автоматизаций в EvaProject - российском аналоге Jira. В ней рассказывается о том, с чем пришлось столкнуться при переезде с Jira, и как мы реализовали функционал в нашей системе.",
        "data": "2023-03-29, 16:22",
        "rating": "+7"
    },
    {
        "title": "Миша на севере",
        "description": "Привет всем, меня зовут Миша и я сеньор разработчик EvaTeam. Сейчас я езжу на работу в теплый офис на общественном транспорте. Но было время, когда на работу меня довозил самолет :)\nВ 2015 году я отправился на архипелаг Новосибирские острова, что находится в Северном Ледовитом океане, в качестве специалиста по информационным технологиям и связи. Затем была ещё вторая вахта в 2017 году. Это история о том как я добирался до места, как мы проводили досуг и немного работали на крайнем севере. ",
        "data": "2023-03-20, 14:21",
        "rating": "+85"
    },
    {
        "title": "Инструкция по импорту данных Jira в EvaProject",
        "description": "В статье расскажем, как произвести импорт данных из системы Jira в систему EvaTeam. При импорте будет использоваться API система Jira. В результате импорта в EvaTeam будет перенесена вся необходимая информация: задачи, списки, доски, пользователи, а также все статусы и бизнес‑процессы, которые используются в системе.",
        "data": "2023-03-02, 14:37",
        "rating": "+1"
    },
    {
        "title": "12 способов заканчивать начатое",
        "description": null,
        "data": "2023-02-08, 12:00",
        "rating": "+13"
    },
    {
        "title": "Догнать Jira за полгода… Российская Jira 2.0",
        "description": "Atlassian (Jira, Confluence) ушёл из России. +‑ с июня 2022г. в 8 раз выросло количество обращений на импортозамещение этих сервисов в EvaTeam. Мы в EvaTeam полгода закрывали разрыв по функциональности с Jira и Confluence.\nК декабрю 2022 закрыли разрыв (Осталось улучшить популярные плагины типа «structure») + сделали крутой импорт.\nОсновной болью на декабрь 2022г. оставался интерфейс (по словам клиентов). Он был немного другой, пользователи не хотели привыкать. Было принято стратегическое решение — сделать полный клон. Вариант интерфейса «Jira».\nНиже описание со скриншотами того, что удалось разработать за полгода. Российские разработчики сделали за полгода то, что разрабатывалось и внедрялось 20 лет (первый релиз Jira 2002 год).\nКратко, что будет в этой статье:\nWorkFlow, GitHub, GitLab, Автоматизация, Миграция из Jira № 1, Гант, Отчеты, Дашборды, Time‑tracker, BQL, аналоги плагинов Tempo, Scriptrunner, draw.io, а также On‑Premise‑версия и т. д. в обновленной EvaProject и EvaWiki",
        "data": "2023-02-02, 15:54",
        "rating": "+20"
    },
    {
        "title": "Как Израиль построил самую эффективную IT-индустрию в мире",
        "description": "В мае 2022 года в некоторых СМИ писали, что Яндекс собирается перебраться в Землю Обетованную. Якобы Аркадий Волож написал письмо премьер-министру Израиля Нафтали Беннету с просьбой о переезде штаб-квартиры компании. И хотя осуществить задуманное не получилось, возникает вопрос: а почему именно Израиль?\nВозможно, потому что Яндекс понимает, что оказались бы в стране с одной из самых развитых и защищенных IT инфраструктур в мире? Да, пожалуй. Но как получилось, что маленькая пустынная страна с населением всего 9,7 миллиона человек, находящаяся всю свою историю в состоянии войны, смогла в 2021 году привлечь 25 млрд долларов инвестиций в свои IT компании? Давайте попробуем разобраться.",
        "data": "2023-01-26, 15:32",
        "rating": "+24"
    },
    {
        "title": "Гиперфокус: как сосредоточиться на главном (Чек-лист по его включению в конце)",
        "description": null,
        "data": "2023-01-13, 14:40",
        "rating": "+3"
    },
    {
        "title": "Спасите свои данные Jira и Confluence",
        "description": "Для многих уход австралийской компании по разработке программного обеспечения в начале марта стал настоящим потрясением. Хотя многие ПО от Atlassian продолжали действовать на российском рынке, однако возможности продлить лицензию не было.\nСчастливчики, которые успели приобрести лицензию до марта продолжали пользоваться программным обеспечением Atlassian и ещё не подозревали, с какими проблемами они столкнутся в будущем.\nСпойлер: не откладывайте резервное копирование данных на потом.",
        "data": "2022-12-16, 16:11",
        "rating": "+4"
    },
    {
        "title": "30 лет гибкой разработки — краткая история и к чему нас это ведет",
        "description": null,
        "data": "2022-11-22, 19:54",
        "rating": "-2"
    }
]