[
    {
        "title": "Инструменты наблюдаемости, о которых нужно знать в 2023 году",
        "description": "Когда организации переходят в облако, их системы тоже начинают стремиться к распределённым архитектурам. Один из самых распространённых примеров этого — использование микросервисов. Однако это также создаёт новые сложности с точки зрения наблюдаемости.\n\nНеобходимо подбирать подходящие инструменты для мониторинга, отслеживания и трассировки этих систем при помощи анализа выходных результатов посредством метрик, логов и трассировок. Это позволяет командам разработчиков быстро выявлять первопричины проблем, устранять их и оптимизировать производительность приложений, ускоряя выпуск кода.\n\nВ этой статье мы рассмотрим возможности, ограничения и важные особенности одиннадцати популярных инструментов наблюдаемости, что позволит вам выбрать наиболее подходящий для вашего проекта.",
        "data": "2023-03-20, 16:00",
        "rating": 13
    },
    {
        "title": "Как создать аппаратный эмулятор CD-ROM без паяльника",
        "description": "Несмотря на то, что постепенно оптические диски уходят в прошлое, использование ISO-образов этих дисков остаётся актуальным. Многие операционные системы поставляются в виде ISO-образов, а администраторам необходимо поддерживать разношёрстный парк старых персональных компьютеров.\n\nСуществует множество решений, как можно установить операционную систему с ISO-образа без записи его на оптический носитель. Я уже затрагивал тему ISO-образов в моих статьях: «Раскрываем секреты загрузочных ISO-образов» и «Что вам нужно знать о внешних загрузочных дисках».\n\nВ этой статье я хочу рассказать о ещё одном способе, который, как оказывается, вшит в ядро Linux. Если ваш одноплатный компьютер имеет USB OTG-разъём, и на него возможна установка Linux, то вы c большой долей вероятности можете сделать из одноплатника аппаратный эмулятор привода оптических дисков.\n\nМеня этот способ заинтересовал. Я проверил его сам и, получив положительный результат у себя, решил поделиться с вами.\n\nЯ сам узнал много интересного, систематизировал свои знания, поэтому надеюсь, что чтение будет познавательно и интересно для вас.",
        "data": "2023-03-20, 12:00",
        "rating": 66
    },
    {
        "title": "Всё про USB-C: ответ через протокол PD",
        "description": "В последней статье мы настроили FUSB302 на получение сообщений USB PD и успешно получили «оповещение о возможностях» от БП с USB-C. В этой же статье мы обратимся к спецификации PD, спарсим сообщение, после чего создадим ответ, который заставит БП подать максимально возможное напряжение.",
        "data": "2023-03-19, 13:00",
        "rating": 37
    },
    {
        "title": "Зачем учёные делают компьютеры на грибах и конопле?",
        "description": "В начале февраля 2023 года мировые новостные агентства сообщили о том, что британские учёные™ учинили очередной научный эксперимент повышенной причудливости. На сей раз — с грибами. Нет, не в смысле психоделики, а в смысле, внезапно, информационных технологий.\n\nВ лаборатории нетрадиционных вычислений (sic!) (Unconventional Computing Laboratory) Университета Западной Англии в Бристоле собрали работающую электронную схему, в которой традиционная элементная база на кремнии и металле совмещается с живой грибницей. И всё это умудряется ещё и работать.\n\nКонечно, далеко не так эффективно и быстро, как работала бы обычная схема на традиционном «железе» без грибов — но всё же. Более того, электроды из нитей грибного мицелия обладают возможностью самовосстановления: они «зарастают» повреждённые участки.",
        "data": "2023-03-18, 13:00",
        "rating": 33
    },
    {
        "title": "Основы фронтенд-разработки: фреймворки, DOM-дерево, взаимодействие с бэкендом",
        "description": "Современная сфера веб-разработки пестрит всевозможными технологиями и инструментами, среди которых новичок может легко растеряться. Статья посвящена общему обзору принципов фронтенд- и бэкенд-разработки, а также знакомит начинающих с наиболее актуальными инструментами и навыками, которые им потребуются для успешного продвижения по карьерному пути.",
        "data": "2023-03-17, 16:00",
        "rating": 30
    },
    {
        "title": "Почему учёные не любят новые идеи",
        "description": "Каждые несколько месяцев СМИ облетает новость с громким заголовком, объявляющим очередную революцию в одной или даже нескольких наиболее глубоко укоренившихся научных идеях. Заявления эти всегда масштабны и революционны: от «Большого взрыва никогда не было» до «Эта идея позволяет отказаться от тёмной материи и тёмной энергии», от «Чёрных дыр не существует» до «Возможно, это неожиданное астрономическое явление вызвано инопланетянами». И, тем не менее, несмотря на широкое освещение очередного новаторского предложения, чаще всего оно так и остаётся прозябать, привлекая мало внимания основной массы учёных и не вызывая ничего, кроме отрицаний.\n\nОбычно считается, что учёные в конкретной области науки, к которой относится громкая новость, склонны к догме и привержены старым идеям. Такое представление может быть популярно среди учёных, придерживающихся противоположных взглядов, или тех, кто сам придерживается иных убеждений, но оно представляет научную истину в ложном свете. В действительности доказательств, поддерживающих преобладающие теории, всегда более чем достаточно, а новые предложения, привлекающие внимание авторов новостей, не более убедительны, чем детский лепет. Вот четыре самых больших недостатка, которые обычно встречаются в новых идеях. Из-за них вы никогда больше не услышите о большинстве новомодных идей после того, как они были впервые выдвинуты.",
        "data": "2023-03-17, 12:00",
        "rating": 45
    },
    {
        "title": "Тестируем аккумуляторы для грузовых автомобилей: Banner Buffalo Bull SHD 725 03",
        "description": "Привет, Хабр! Не легковушкой единой жив человек. Иногда даже IT-самураю, придерживающемуся в быту предельной минималистичности, чтобы ничего не отвлекало от интеллектуальных свершений, приходится заказывать что-нибудь крупногабаритное.\n\nЭто может быть радость приобретения огромного OLED-телевизора или уютного предмета мебели. Ещё радостнее, когда приобретение обусловлено добрым событием в семье. Например, получением наследства рождением нового Человека.\n\nА уж общество и бизнес не могут жить без грузового транспорта вообще. Потому сегодня испытаем пару аккумуляторов для грузовых автомобилей, ёмкостью целых 225 А*ч. Почему именно пару, узнаем далее.",
        "data": "2023-03-16, 16:00",
        "rating": 32
    },
    {
        "title": "Промышленная автоматизация и создание своих производственных линий как перспективная сфера приложения усилий",
        "description": "Картинка Jcomp, Freepik\n\nНаблюдая за тем, как самодельщики разрабатывают 100500-й вариант NAS с резервным питанием, мне подумалось, что стоит поднять гораздо более интересную тему, которая позволяет раскрыть свои навыки, реализуя увлекательные проекты, и предоставляет поистине неисчерпаемый источник сложных инженерных вызовов. А ведь мы все любим такое, не так ли? ;-)\n\nРечь в этой статье пойдёт о построении любительских систем автоматизации, ведь если оглянуться вокруг, то множество процессов могут быть легко автоматизированы людьми, имеющими даже минимальное знание программирования и чуть-чуть дружащих с руками. Второе в принципе под вопросом, так как можно всё требующееся смоделировать на компьютере в 3D, в инженерном CAD, после чего отдать на лазерную резку, сварку и т. д. Хотя, если вы это умеете, это весьма невредно для глубинного понимания процессов.",
        "data": "2023-03-16, 12:00",
        "rating": 40
    },
    {
        "title": "Потоки событий бесполезны без действий",
        "description": "Каждая точка данных в системе, регулярно генерирующей данные, соответствует событию (Event). Потоки событий (Event Stream) — это непрерывный поток событий или точек данных. Иногда потоки данных называют в сообществе разработчиков потоками данных (Data Stream), потому что они состоят из непрерывных точек данных. Event Stream Processing — это действия, выполняемые с генерируемыми событиями.\n\nВ этой статье подробно рассматриваются потоки данных и Event Stream Processing, рассказывается, как работает Event Stream Processing, объясняются различия между Event Stream Processing и Batch Processing, преимущества и способы применения ESP, а завершается она наглядным примером Event Stream Processing.",
        "data": "2023-03-15, 16:00",
        "rating": 28
    },
    {
        "title": "Выгорание программиста. Интересная работа — самая опасная",
        "description": "Среди айтишников мало жизнерадостных людей… Скорее наоборот, многие выглядят несчастными, а если провести анкетирование, то 83% проявляют признаки выгорания, хотя до крайней степени истощения и цинизма ещё не дошли. Но постоянная когнитивная нагрузка и хронический стресс ведут к закономерному результату:\n\nвыгорание,\nфизическая деградация,\nдепрессия,\nранний уход из профессии.\n\nВсе эти последствия хорошо предсказуемы. Поэтому их можно предотвратить.",
        "data": "2023-03-15, 12:00",
        "rating": 61
    },
    {
        "title": "Учимся тестированию с помощью Bootstrap",
        "description": "Ознакомительное руководство по использованию Bootstrap для создания веб-страниц и тестирования. Здесь вы узнаете, из чего состоит фреймворк Bootstrap, какие есть варианты его установки и использования, а также как именно с его помощью можно создавать веб-страницы и тестировать их.",
        "data": "2023-03-14, 16:00",
        "rating": 29
    },
    {
        "title": "Проверка XML. Schematron",
        "description": "Так или иначе, все сервисы сталкиваются с задачами валидации. Часто они сводятся к простым и однотипным проверкам: заполнены ли все обязательные поля, верен ли формат телефонного номера, кредитной карты и пр. Но существуют проекты, в которых условия и правила проверок более разнообразные, да и те временами требуют серьёзного пересмотра. Внесение же изменений или создание дополнительных правил валидации требует непростых согласований и привлечения внимания нескольких команд разработчиков, обновления документации.\n\nНедавно мне довелось поучаствовать в проекте, особую роль в котором занимают функции форматно-логического контроля входящих документов. Как следствие, у меня появились некоторые варианты решения подобных задач. Одним из них я и хочу поделиться.",
        "data": "2023-03-14, 12:00",
        "rating": 38
    },
    {
        "title": "О трудном и утомительном пути от идеи до веб-сайта",
        "description": "2017 год. Я уже около шести лет работаю в компании, продающей кубики Рубика, и начинаю испытывать зуд от желания попробовать что-то новое. Несколько лет проработав с физическими товарами, я осознал, что всегда хотел работать в полностью онлайновом и виртуальном бизнесе, в котором не придётся иметь дело с материальными продуктами (и не испытывать связанной с ними головной боли).",
        "data": "2023-03-13, 17:00",
        "rating": 35
    },
    {
        "title": "Джон Кармак взялся за сильный ИИ — и у него особый подход. Список фундаментальной литературы для начала",
        "description": "В рубрике «Выдающиеся программисты 21 века» уже была статья про гения программирования Джона Кармака, создателя движков для Doom, Quake и других культовых игр. Потом он занялся разработкой ракет (они в Armadillo Aerospace реализовали вертикальную посадку раньше SpaceX), а затем — систем VR, софта для Oculus Rift и других устройств. Сейчас началась четвёртая фаза в его карьере.\n\nВ интервью изданию Dallas Innovates 52-летний Кармак рассказал о новом проекте — системе сильного ИИ (AGI), над которым он работает самостоятельно, без участия больших корпораций, как отшельник в своём особняке в Далласе.\n\nСильный ИИ общего назначения не будет уступать среднему человеку в понимании происходящего и решении проблем. По оценке Кармака, с вероятностью 60% такая система (альфа-версия) будет создана до 2030 года, с вероятностью 95% — до 2050 года. Это самая важная и интересная задача, которая сейчас стоит перед человечеством.",
        "data": "2023-03-13, 12:00",
        "rating": 87
    },
    {
        "title": "5 полезных библиотек Python (с примерами)",
        "description": "Python остается топ 1 среди языков программирования по версии многих журналов и сайтов. Популярность языка и его большое сообщество привело к тому, что сейчас для Python существует огромное число библиотек. К сожалению, большая часть этих библиотек была создана энтузиастами и больше не поддерживается. Давайте посмотрим на 5 хороших развивающихся библиотек, которые могут помочь при решении практических задач.",
        "data": "2023-03-13, 09:00",
        "rating": 48
    },
    {
        "title": "Всё про USB-C: взаимодействие через низкоуровневый протокол PD",
        "description": "В нашей серии статей про USB-C мы проговорили немало аспектов этого стандарта, среди которых были как хорошо известные, так и не очень, в том числе пара таких, которые только обозначились в сети. Мы до определённой степени разобрали почти всё, за исключением USB Power Delivery. Я немного описала этот протокол в статье про обеспечение питания, но тогда речь шла в основном про то, как использовать PD, просто купив правильное решение. Но для электронщика этого недостаточно, так что давайте посмотрим, удастся ли нам собрать собственную триггерную плату с PD.",
        "data": "2023-03-12, 13:00",
        "rating": 43
    },
    {
        "title": "Взлёт и падение Живого Журнала. Часть 2: расцвет и закат русскоязычного ЖЖ",
        "description": "Как мы рассказывали в прошлой части, эпоху расцвета русскоязычного ЖЖ можно отсчитывать с 2005 года. Почему именно с него?\n\nНапомним вкратце. 2004 год стал временем бурного и стремительного роста русскоязычной аудитории ЖЖ. В январе она составляла порядка 40 тысяч, к концу года — уже несколько сотен тысяч. Из площадки для наиболее интернет-продвинутых пользователей, исходно в изрядной степени — работающих в США айтишников из стран бывшего СССР, ЖЖ быстро превращался в основную площадку для русскоязычных блогов. А заодно и своего рода прото-соцсеть.\n\nНе будет преувеличением сказать, что для рунета второй половины нулевых годов ЖЖ был почти тем же, чем ВК — для 2010-х. Да, существовали и другие площадки. Да, некоторые считали сидеть в ЖЖ дурным тоном так же, как некоторые по сей день предпочитают не иметь аккаунтов в ВК. Но самым популярным и самым интересным для «типичного пользователя рунета» конца 2000-х был именно «Живой Журнал».",
        "data": "2023-03-11, 13:00",
        "rating": 62
    },
    {
        "title": "Нестандартный лайфхак: печатаем по ткани, используя 3D-принтер",
        "description": "Картинка: Valentinlacoste, Freepik\n\nНа днях меня посетила любопытная мысль: а что, если 3D-принтер использовать необычным образом, а именно для нанесения разных надписей, изображений и логотипов прямо на ткань?",
        "data": "2023-03-10, 16:00",
        "rating": 56
    },
    {
        "title": "Сложности проектирования своего пико-спутника. Или спутник разработать — не блинов напечь",
        "description": "Инженерная разработка, или в данном случае опытно-конструкторская разработка по созданию пико-спутника-космического сервера, гораздо ближе к исследовательской деятельности (недаром ОКР часто объединяют с научным исследованием, чтобы получился НИОКР), чем к производству.\n\nКлассическое планирование «водопадом» тут не работает. Программисты это давно поняли и перешли на гибкие методологии разработки, а вот космическая техника до сих пор под гнётом нормативной документации, которая в лучшем случае похожа на «спираль».\n\nКогда вы печёте тысячный блин, вы можете уверенно сказать, сколько у вас это займёт времени. Да, будет вариативность в сроках поставки ингредиентов, нагрев плиты займёт какое-то время, но всё равно процесс довольно прогнозируемый. Другое дело — создание космического аппарата, где «вновь открывшиеся обстоятельства» в виде очередного инженерного расчёта диктуют переделку всей конструкции и меняют все запланированные ранее работы.\n\nВот и мы рассчитывали к концу января уже получить опытный образец спутника для испытаний, а получили очередную итерацию разработки. Но при этом считаем своим долгом рассказать читателям о прогрессе в нашем проекте.",
        "data": "2023-03-10, 12:00",
        "rating": 60
    },
    {
        "title": "Обойти айти: есть ли жизнь за пределами золотой клетки?",
        "description": "Уйти из айти невероятно сложно: престижная работа, неизменный wow-эффект у знакомых, заработная плата и условия выше рынка или как минимум лучше среднего, постоянное развитие, интересные отраслевые события, отличные отношения с удалёнкой… Да ну, где вы видели этих безумцев?! А они есть: люди, которые в 25, 35, 40, 45 лет бросают должности, проекты и компании и уходят в мир других задач, интересов, людей. Кто-то педантично готовит план, подстилает соломку и аккуратно шагает с корабля на корабль, кто-то громко хлопает дверью и знает, куда идти и что делать, а кто-то уходит в никуда, сидит дома, лечит выгорание и ломку привычки к упорной нагруженной работе… В целом, это болезненный переход: как по деньгам, там и по моральным компонентам. Решиться невероятно трудно. Так давайте разберёмся, зачем ломать прутья золотой клетки и что именно щекочет воздух свободы.",
        "data": "2023-03-09, 16:00",
        "rating": 54
    }
]